<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Linux-uvc-devel] Little questions about uvcvideos... And possible	solutions to my problem.
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/linux-uvc-devel/2008-January/index.html" >
   <LINK REL="made" HREF="mailto:linux-uvc-devel%40lists.berlios.de?Subject=Re%3A%20%5BLinux-uvc-devel%5D%20Little%20questions%20about%20uvcvideos...%20And%20possible%0A%09solutions%20to%20my%20problem.&In-Reply-To=%3CD3FD41E5-6A42-4F53-AE89-BDD80C46FD53%40gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="002848.html">
   <LINK REL="Next"  HREF="002852.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Linux-uvc-devel] Little questions about uvcvideos... And possible	solutions to my problem.</H1>
    <B>Pierre MARTIN</B> 
    <A HREF="mailto:linux-uvc-devel%40lists.berlios.de?Subject=Re%3A%20%5BLinux-uvc-devel%5D%20Little%20questions%20about%20uvcvideos...%20And%20possible%0A%09solutions%20to%20my%20problem.&In-Reply-To=%3CD3FD41E5-6A42-4F53-AE89-BDD80C46FD53%40gmail.com%3E"
       TITLE="[Linux-uvc-devel] Little questions about uvcvideos... And possible	solutions to my problem.">hickscorp at gmail.com
       </A><BR>
    <I>Mon Jan 28 11:29:07 CET 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="002848.html">[Linux-uvc-devel] Driver 05a9:2641 OmniVision Technologies
</A></li>
        <LI>Next message: <A HREF="002852.html">[Linux-uvc-devel] Little questions about uvcvideos... And possible solutions to my problem.
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2849">[ date ]</a>
              <a href="thread.html#2849">[ thread ]</a>
              <a href="subject.html#2849">[ subject ]</a>
              <a href="author.html#2849">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hello people,

First of all, happy new year to everyone reading this, since i'm new  
here :)
i have discovered the linux uvc project for a few days now, i have  
been looking for a good quality, supported webcam under linux, and i  
have to admit, the documentation lacks a lot...

So here is what i want to achieve:
We need a software which takes a snap of 5 connected webcams (The  
snapshots will then be used to make an accurate 3D mesh of the shooted  
object).

My first attempt was on Labtec webcam pro, which were working pretty  
well under linux with gpsa.
i have made a little application with C++ / Qt 4.3, which just calls  
vgrabbj on /dev/video* in a process. After the process ends, the  
pictures were retrieved and displayed...

The problem with this solution, was the resolution... 640x480 was not  
enough, the people told me that they need at least 1024x768.
So i have searched the internet, posted on forums, no one answered  
me... So i bought several QuickCam 9000.
Now, i'm trying to make them work the same way... And surprise: they  
can't work with my previous application, because vgrabbj can't handle  
the format in /dev/video*...

So i have looked at luvcview, and v4l also (i dont really understand  
what v4l has to do with everything here, i have never played with  
that). The result is, that i'm having several issues with both of them.

So my question is simple...
Is there any program, shell script, magic carot command which i can  
use to get a SIMPLE single shot on this device?

i'm on this project for a week now, i thought it would take a few  
hours to make... But the lack of doc / people on the net made me take  
a serious delay on the thing, so this request is kind of urgent...

Thanks a lot for your time, i hope that my request is clear. If not,  
feel free to tell me that my english is really bad, and you need some  
explaination about this or that :D

PS: Below is an email sent to the maintainer of luvcview, it is more  
precise about what i need to achieve... The email is in french.

Kind regards,
Pierre.


Bonjour,

Je m'appelle Pierre, et j'ai trouv&#233; votre site en faisant des  
recherches &#224; propos de ma probl&#233;matique...
J'ai actuellement un projet en cours, et j'aimerais vous demander un  
petit coup de main (Ceci n'est pas une requ&#234;te de support, si la  
partie descriptive vous emb&#234;te, passez directement &#224; la fin).

Voil&#224; l'id&#233;e:
Je dois cr&#233;er un petit soft (Je fais le dev sous macosx avec comme  
target linux) permettant de commander 5 webcams simultan&#233;ment (donc  
branch&#233;es sur la m&#234;me machine).
J'ai d&#233;ja quelque chose de fonctionnel, bas&#233; sur du QT et des appels &#224;  
vgrabbj... Cela fonctionne parfaitement avec des webcams labtec, mais  
il se trouve que les personnes me demandant cette application ont  
besoin d'obtenir des clich&#233;s de 1024x768 au minimum...

J'ai donc &#233;t&#233; chercher des Quickcam Pro 9000, webcam qui m'a sembl&#233;  
&#234;tre une des seules disponibles et compatible linux, avec comme  
r&#233;solution du xga.

Une fois les drivers UVC compil&#233;s et install&#233;s, j'essaye mon appli, et  
l&#224; je me rend compte que vgrabbj n'a pas l'air de comprendre ce qu'il  
voit dans /dev/video0... Aucune erreur, mais une image verte en sortie.

Je m'orriente alors vers des recherches sur internet (Le sujet n'est  
vraiment pas assez document&#233; pour le grand public je trouve) et l&#224; je  
tombe donc sur votre application, luvcview.

LUVCView fonctionne environ une fois sur 3 quand je la lance &#224; partir  
d'un xterm (sous XFCE). Les autres fois j'obtiens ceci:

luvcview version 0.2.1
Xlib: connection to &quot;:0.0&quot; refused by server
Xlib: XDM authorization key matches an existing client!
Couldn't initialize SDL: Couldn't open X11 display

Quand l'application fonctionne, elle fonctionne bien, sauf au premier  
lancement o&#249; la palette semble &quot;brul&#233;e&quot;.

Si je liste les modes possibles, j'obtiens:

/dev/video0 does not support read i/o
{ pixelformat = 'MJPG', description = 'MJPEG' }
{ discrete: width = 160, height = 120 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 176, height = 144 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 320, height = 240 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 352, height = 288 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 640, height = 480 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 800, height = 600 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 960, height = 720 }
         Time interval between frame: 1/15, 1/10, 1/5,
{ pixelformat = 'YUYV', description = 'YUV 4:2:2 (YUYV)' }
{ discrete: width = 160, height = 120 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 176, height = 144 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 320, height = 240 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 352, height = 288 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 640, height = 480 }
         Time interval between frame: 1/30, 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 800, height = 600 }
         Time interval between frame: 1/25, 1/20, 1/15, 1/10, 1/5,
{ discrete: width = 960, height = 720 }
         Time interval between frame: 1/10, 1/5,
{ discrete: width = 1600, height = 1200 }
         Time interval between frame: 1/5,

Mais quand je lance luvcview avec comme param&#232;tre une taille au del&#224;  
de 800 par 600, je r&#233;cup&#232;re l'erreur suivante:

X Error of failed request:  BadAlloc (insufficient resources for  
operation)
   Major opcode of failed request:  140 (XVideo)
   Minor opcode of failed request:  19 ()
   Serial number of failed request:  25
   Current serial number in output stream:  26

De l&#224; mes questions sont les suivantes:
1) Comment puis-je r&#233;gler le probl&#232;me de r&#233;solution? J'aimerais  
pouvoir shooter en 1600x1200 ou &#224; d&#233;faut en 960x720...
2) Auriez vous par hasard un code source ou un script shell permettant  
de faire une acquisition d'image sur une telle webcam? Mon projet est  
open source, si vous &#234;tes d'accord pour que j'utilise vos sources bien  
s&#251;r. Le but du jeu &#233;tant bien sur de lancer cet outil dans un process  
&#224; partir de mon appli, et qu'&#224; la fin du process si l'exitcode est ok,  
je puisse r&#233;cup&#233;rer une image exploitable...

Je suis cens&#233; avoir termin&#233; demain, je suis press&#233; par le temps. Si  
vous ne pouvez pas me r&#233;pondre, pourriez-vous SVP m'aiguiller vers des  
resources me permettant d'effectuer ce que je veux?

En vous remerciant de votre temps et de votre attention,
Amicalement,
Pierre.

-------------- next part --------------
An HTML attachment was scrubbed...
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/linux-uvc-devel/attachments/20080128/5c1d659c/attachment.html">https://lists.berlios.de/pipermail/linux-uvc-devel/attachments/20080128/5c1d659c/attachment.html</A>&gt;
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="002848.html">[Linux-uvc-devel] Driver 05a9:2641 OmniVision Technologies
</A></li>
	<LI>Next message: <A HREF="002852.html">[Linux-uvc-devel] Little questions about uvcvideos... And possible solutions to my problem.
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2849">[ date ]</a>
              <a href="thread.html#2849">[ thread ]</a>
              <a href="subject.html#2849">[ subject ]</a>
              <a href="author.html#2849">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/linux-uvc-devel">More information about the Linux-uvc-devel
mailing list</a><br>
</body></html>
