<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Linux-uvc-devel] &#22823;&#20154;&#12398;&#32654;&#22899;&#12398;&#35023;&#20307;&#39443;
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/linux-uvc-devel/2006-August/index.html" >
   <LINK REL="made" HREF="mailto:linux-uvc-devel%40lists.berlios.de?Subject=Re%3A%20%5BLinux-uvc-devel%5D%20%3D%3Fiso-2022-jp%3Fb%3FGyRCQmc/TSROSH49dyROTiIbKEI%3D%3F%3D%0A%09%3D%3Fiso-2022-jp%3Fb%3FGyRCQk44MxsoQg%3D%3D%3F%3D&In-Reply-To=%3C20060824154504.249335DD57%40bat.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000733.html">
   <LINK REL="Next"  HREF="000731.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Linux-uvc-devel] &#22823;&#20154;&#12398;&#32654;&#22899;&#12398;&#35023;&#20307;&#39443;</H1>
    <B>yurie</B> 
    <A HREF="mailto:linux-uvc-devel%40lists.berlios.de?Subject=Re%3A%20%5BLinux-uvc-devel%5D%20%3D%3Fiso-2022-jp%3Fb%3FGyRCQmc/TSROSH49dyROTiIbKEI%3D%3F%3D%0A%09%3D%3Fiso-2022-jp%3Fb%3FGyRCQk44MxsoQg%3D%3D%3F%3D&In-Reply-To=%3C20060824154504.249335DD57%40bat.berlios.de%3E"
       TITLE="[Linux-uvc-devel] &#22823;&#20154;&#12398;&#32654;&#22899;&#12398;&#35023;&#20307;&#39443;">bopwek468gwpo at yahoo.co.jp
       </A><BR>
    <I>Thu Aug 24 17:45:04 CEST 2006</I>
    <P><UL>
        <LI>Previous message: <A HREF="000733.html">[Linux-uvc-devel] Still no luck with Logitech QuickCam Notebook	Pro
</A></li>
        <LI>Next message: <A HREF="000731.html">[Linux-uvc-devel] Logitech QC Orbit MP not working - uvccapture	andluvcview fail [solved]
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#730">[ date ]</a>
              <a href="thread.html#730">[ thread ]</a>
              <a href="subject.html#730">[ subject ]</a>
              <a href="author.html#730">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#27704;&#20037;&#23436;&#20840;&#28961;&#26009;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;
&#12288;&#12288;&#12288;&#12539;&#12539;&#12539;&#21021;&#23550;&#38754;&#65331;&#65317;&#65336;&#26368;&#20778;&#20808;&#12398;&#22823;&#20154;&#12398;&#23494;&#20250;&#12469;&#12452;&#12488;&#12539;&#12539;&#12539; 
&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;&#12316;

&#19990;&#12398;&#20013;&#12391;&#12399;&#12354;&#12394;&#12383;&#12398;&#24819;&#20687;&#12434;&#36234;&#12360;&#12427;&#12411;&#12393;&#12289;&#36229;&#22793;&#24907;&#12394;&#22899;&#24615;&#12364;&#22810;&#12356;&#12392;&#12356;&#12358;&#29694;&#23455;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65281;
&#12371;&#12398;&#12469;&#12452;&#12488;&#12399;&#20840;&#22269;NO.1&#12398;&#22793;&#24907;&#22909;&#12365;&#12398;&#22899;&#24615;&#12364;&#38598;&#12414;&#12427;&#23436;&#20840;&#28961;&#26009;&#65320;&#12501;&#12524;&#12531;&#12489;&#20986;&#20250;&#12356;&#12398;&#12469;&#12452;&#12488;&#12391;&#12377;&#12290;

&#12304;&#20837;&#21475;&#12399;&#12467;&#12481;&#12521;&#12305; <A HREF="http://re-w.com/index.html?media=pc618">http://re-w.com/index.html?media=pc618</A>

==========&#24403;&#12469;&#12452;&#12488;&#12509;&#12522;&#12471;&#12540;=====================================================================

&#8251;&#12527;&#12531;&#12463;&#12522;&#12483;&#12463;&#35408;&#27450;&#31561;&#19968;&#20999;&#28961;&#12356;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;
&#8251;&#24403;&#12469;&#12452;&#12488;&#12372;&#21033;&#29992;&#32773;&#12398;&#12372;&#24847;&#35211;&#12395;&#12424;&#12426;&#12289;&#25658;&#24111;&#38651;&#35441;&#20351;&#29992;&#32773;&#12398;&#28858;&#12398;&#20351;&#12356;&#26131;&#12373;&#12434;&#37325;&#35222;&#12375;&#12414;&#12375;&#12383;&#12290;
&#12288;&#12513;&#12540;&#12523;&#12398;&#20132;&#25563;&#31561;&#12364;&#22823;&#22793;&#34892;&#12394;&#12356;&#26131;&#12356;&#12392;&#22823;&#22909;&#35413;&#12391;&#12377;&#12398;&#12391;&#12289;&#26159;&#38750;&#12302; &#25658;&#24111;&#12450;&#12489;&#12524;&#12473; &#12303;&#12363;&#12425;&#12398;&#30331;&#37682;&#12364;&#12362;&#21223;&#12417;&#12391;&#12377;&#12290;
&#12288;&#23578;&#12371;&#12398;&#12469;&#12452;&#12488;&#12399;&#23433;&#24515;&#12375;&#12390;&#12372;&#21033;&#29992;&#12375;&#12390;&#12356;&#12383;&#12384;&#12369;&#12427;&#12424;&#12358;&#19975;&#20840;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#23550;&#31574;&#12398;&#12383;&#12417;
&#12288;&#30331;&#37682;&#12398;&#38555;&#12399;&#12501;&#12522;&#12540;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12391;&#12399;&#12372;&#30331;&#37682;&#12391;&#12365;&#12394;&#12356;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12362;&#12426;&#12414;&#12377;&#12290;
&#12288;&#12501;&#12522;&#12540;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12391;&#12398;&#30331;&#37682;&#12418;&#24076;&#26395;&#12398;&#26041;&#12399;&#12289;&#12362;&#25163;&#25968;&#12391;&#12377;&#12364;&#12289;&#30331;&#37682;&#23436;&#20102;&#24460;&#12395;&#22793;&#26356;&#12375;&#12390;&#12356;&#12383;&#12384;&#12365;&#12414;&#12377;&#12424;&#12358;
  &#12362;&#39000;&#12356;&#12356;&#12383;&#12375;&#12414;&#12377;&#12290;

===============================================================================================

&#22899;&#24615;&#12399;&#12289;&#12415;&#12435;&#12394;&#12473;&#12465;&#12505;&#12391;&#12377;&#12290;&#29305;&#12395;&#32654;&#22899;&#12399;&#12394;&#12362;&#12373;&#12425;&#8230;
&#22899;&#24615;&#12363;&#12425;&#12398;&#12383;&#12367;&#12373;&#12435;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12354;&#12394;&#12383;&#12395;&#23626;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12300;&#26086;&#37027;&#12364;&#12356;&#12394;&#12356;&#26172;&#38291;&#12289;&#35504;&#12363;&#12363;&#12414;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12301;
&#12300;&#20170;&#12289;&#21942;&#26989;&#12398;&#20181;&#20107;&#20013;&#12289;&#20932;&#12367;&#26247;&#12391;&#12377;&#12290;&#36938;&#12435;&#12391;&#12367;&#12428;&#12414;&#12379;&#12435;&#12363;&#65311;&#12301;
&#12300;&#26997;&#31192;&#12391;&#12289;&#36938;&#12435;&#12391;&#19979;&#12373;&#12356;&#9834;&#12301;
&#12300;&#31169;&#12398;&#12362;&#12387;&#12401;&#12356;&#12289;&#22909;&#12365;&#12394;&#12384;&#12369;&#12289;&#12395;&#12366;&#12425;&#12379;&#12390;&#12354;&#12370;&#12414;&#12377;&#12290;&#12381;&#12398;&#12354;&#12392;
&#12288;&#12354;&#12394;&#12383;&#12398;&#9675;&#9675;&#9675;&#35302;&#12425;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#65281;&#12381;&#12428;&#12364;&#24555;&#24863;&#12394;&#12435;&#12391;&#12377;&#12290;&#12301;
&#20449;&#12376;&#12425;&#12428;&#12394;&#12356;&#12392;&#24605;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12377;&#12368;&#20250;&#12360;&#12427;&#12392;&#12356;&#12358;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#21106;&#12392;&#26089;&#12367;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#26469;&#12427;&#12398;&#12364;&#12509;&#12452;&#12531;&#12488;&#12391;&#12377;&#12290;
&#27442;&#27714;&#19981;&#28288;&#12394;&#22899;&#24615;&#12364;&#22810;&#12356;&#12363;&#12425;&#12289;&#23569;&#12375;&#35441;&#12375;&#12383;&#24460;&#12399;&#22823;&#20307;&#12507;&#12486;&#12523;&#12363;&#22899;&#24615;&#12398;&#37096;&#23627;&#12395;&#30452;&#34892;&#12364;&#24517;&#28982;&#30340;&#12391;&#12377;&#12290;

&#12304;&#20837;&#21475;&#12305; <A HREF="http://re-w.com/index.html?media=pc618">http://re-w.com/index.html?media=pc618</A>

&#32020;&#24859;&#12289;&#19981;&#20523;&#12289;&#20307;&#12384;&#12369;&#12398;&#38306;&#20418;&#12394;&#12393;&#12354;&#12394;&#12383;&#12398;&#24076;&#26395;&#12395;&#24540;&#12360;&#12414;&#12377;

&#12288;&#9733;&#9733;&#27704;&#20037;&#23436;&#20840;&#28961;&#26009;&#20869;&#35379;&#9733;&#9733;
&#12288;&#12288;&#20837;&#20250;&#36027;&#12288;&#12288;&#12288;&#12288;&#12288;&#65306;0&#20870;
&#12288;&#12288;&#24180;&#20250;&#36027;&#12288;&#12288;&#12288;&#12288;&#12288;&#65306;0&#20870;
&#12288;&#12288;&#30452;&#12450;&#12489;&#36865;&#21463;&#20449;&#12288;&#12288;&#65306;0&#20870;
&#12288;&#12288;&#38651;&#35441;&#30058;&#21495;&#36865;&#21463;&#20449;&#12288;&#65306;0&#20870;
&#12304;&#20837;&#21475;&#12305; <A HREF="http://re-w.com/index.html?media=pc618">http://re-w.com/index.html?media=pc618</A>









</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000733.html">[Linux-uvc-devel] Still no luck with Logitech QuickCam Notebook	Pro
</A></li>
	<LI>Next message: <A HREF="000731.html">[Linux-uvc-devel] Logitech QC Orbit MP not working - uvccapture	andluvcview fail [solved]
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#730">[ date ]</a>
              <a href="thread.html#730">[ thread ]</a>
              <a href="subject.html#730">[ subject ]</a>
              <a href="author.html#730">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/linux-uvc-devel">More information about the Linux-uvc-devel
mailing list</a><br>
</body></html>
